package io.myProject.BotanBot.texts;

public abstract class TextsToRespond {

    public static final String[] phrasesCongratulation = {
            "Отличный выбор! Без сомнений - это самый правильный вариант недвижимости в аренду! ",                                  // 1.
            "Превосходный выбор! Такую недвижимость выбирают самые умные! ",                                                        // 2.
            "Достойный выбор! Это популярный вариант у моих клиентов! ",                                                            // 3.
            "Вы сделали прекрасный выбор! Недвижимость с такими параметрами выбирают очень умные люди! ",                           // 4.
            "Хорошее решение! Очень правильный выбор! ",                                                                            // 5.
            "Итак, отлично! Должен сказать, что на сегодняшний день это самый популярный вариант! ",                                // 6.
            "Поздравляю с прекрасным выбором! Очень многие люди нашли себе недвижимость в аренду точно с такими же параметрами! ",  // 7.
            "Чудесное решение! Это популярный выбор у многих людей! ",                                                              // 8.
            "Итак, прекрасно! Такую недвижимость выбирают многие! ",                                                                // 9.
            "Чёткое решение и прекрасный выбор! У меня многие клиенты выбирают именно такую недвижимость! "                         // 10.
    };

    public static final String GREETINGS = ", приятно познакомиться! Меня зовут Бот@Н, я поставщик услуги ChatGPT от Open AI для российских пользователей в условиях санкций. \nВы имеете возможность работать (задавать любые вопросы) ChatGPT в данном телеграм-чате.";
    public static final String INFO = "\", вот информация о том, кто я и что конкретно умею делать. Итак, я поставщик услуги ChatGPT от Open AI для российских пользователей в условиях санкций. Что такое ChatGPT от Open AI и какие у него возможности в справке ниже:\n" +
            "ВОЗМОЖНОСТИ ChatGPT от Open AI:\n" +
            "• ChatGPT — творческий собеседник: отвечает на ваши вопросы, поддерживает беседу;\n" +
            "• Анализирует тексты: помогает анализировать большие объёмы текстовых данных и выявлять скрытые тенденции и важные идеи;\n" +
            "• Генерирует текст: создаёт отчёты, статьи, рекламные материалы, письма и другие виды текста на основе ваших предпочтений;\n" +
            "• Помогает принимать решения: система предоставляет интуитивно понятные ответы на сложные вопросы, основанные на большом количестве данных;\n" +
            "• Распознаёт текст на картинке;\n" +
            "• Пишет код;\n" +
            "• Владеет иностранными языками.\n" +
            "КАК ПОЛЬЗОВАТЬСЯ ↓\n" +
            "• Отправьте сообщение любым удобным способом: текстовое, голосовое или фото с текстом и получите на него ответ.\n" +
            "ПОДСКАЗКИ ↓\n" +
            "• Указывайте в запросе, что именно нужно с ним сделать. Например: «Выполни задание на английском языке… текст задания».\n" +
            "• Если на картинке много текста, отправляйте её по частям.\n" +
            "ГОРЯЧИЕ КНОПКИ ↓\n" +
            "Доступны после каждого ответа:\n" +
            "• Супер, хороший ответ;\n" +
            "• Ответ не устроил или содержит ошибки;\n" +
            "• Повторно направить запрос, обновить ответ;\n" +
            "• Продолжить текст, если он не поместился в сообщение;\n" +
            "• Сбросить контекст диалога и начать новый;\n" +
            "• Озвучить последний ответ голосом.";

    public static final String INTRO = "пора познакомить Вас с моим меню! Внизу есть три кнопки - ‘Личный кабинет’, ‘Возможности бота’ и ‘Оформить подписку’ Выберете и нажмите любую - тогда откроется дополнительная информация по выбранному разделу.\n";
}