package io.myProject.BotanBot.waitings;

public interface Waitings {
    int WAIT_FOR_5_SEC = 5000;
    int WAIT_FOR_3_SEC = 3000;
    int WAIT_FOR_7_SEC = 7000;

    String TEXT = "ТАКЖЕ ВЫ ПОЛУЧИТЕ: \n\n";

    String MAKE_A_USER_TO_PAY = "1. Готовый экземпляр договора с собственником с описью всех предметов в помещении. Этот договор составлен лучшими юристами Москвы и защитит Вас в любой ситуации.\n" +
            "\n" +
            "2. Чек-лист грамотного разговора с владельцем недвижимости - какие вопросы нужно задать ему ОБЯЗАТЕЛЬНО, чтобы быть уверенным в том, что помещение действительно принадлежит ему, а не кому-то другому:\n" +
            "\n" +
            "а). Какие документы нужно обязательно проверить;\n" +
            "б). Как вести разговор, если у Вас есть животные, маленькие дети или если Вы - иностранец;\n" +
            "в). Порядок оплаты за аренду;\n" +
            "г). Оплата коммунальных услуг и ответственность;\n" +
            "д). Если что-то сломалось - кто будет оплачивать ремонт или замену;\n" +
            "е). В каком случае нужно требовать регистрацию договора в гос.органах и почему это выгодно для Вас.\n" +
            "\n" +
            "А также многое другое, необходимое для успешного заключения договора найма жилого помещения.";
    String TELEGRAM_POLICY = "Нажимая кнопку ниже я даю согласие на обработку персональных данных и принимаю условия публичной оферты (https://www.news-telegram.online/policy)";
}